# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1236]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [1238]:
a=pd.Series([100,200,300,400])

Print a, and data type

In [1240]:
print(a)
print(type(a))
print(a.dtype)

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>
int64

Using indexing access the element 300 from the series a.

In [1242]:
print(a[2])

300

What are the values of index for series a?

In [1244]:
print(a.index)

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [1246]:
a.index=['c', 'a', 'b', 'd']
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [1248]:
print(a['d'])

400

Sort the values wrt to the index and print it

In [1250]:
a1=a.sort_index()
print(a1)

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [1252]:
b=pd.Series([800,450,100]) 
b.index=['e','f','g']
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [1254]:
a=pd.concat([a,b])

In [1255]:
#print a again after appending b into it
print(a)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [1257]:
a3=a.sort_values(ascending=False)
print(a3)
print(a3.index)

e    800
f    450
d    400
b    300
a    200
c    100
g    100
dtype: int64
Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section,print the dataframe

In [1261]:
df=a.to_frame(name='Values') 
print(df)

   Values
c     100
a     200
b     300
d     400
e     800
f     450
g     100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [1263]:
print(df.shape)

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [1266]:
# yep its same as the series.

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [1268]:
df.head()

   Values
c     100
a     200
b     300
d     400
e     800

In [1269]:
df.tail()

   Values
b     300
d     400
e     800
f     450
g     100

Rename the column of the dataframe as 'points'

In [1271]:
df.rename(columns={'Values':'points'},inplace=True)

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [1273]:
#Create fruits array

fruits_array=['orange','mango','apple']
random_fruits=np.random.choice(['orange','mango','apple'],size=7,replace=True)

In [1274]:
#Create series fruits out of fruits array

fruits=pd.Series(random_fruits)

Change the index of fruits to the index of dataframe df

In [1276]:
fruits.index=df.index

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [1278]:
df['fruits']=fruits
print(df.head())

   points  fruits
c     100  orange
a     200   mango
b     300   mango
d     400   mango
e     800   apple

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [1281]:
d1={
     'city':['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ],
    'Temperature' : [15, 22, 20, 26,-2] 
}
d1=pd.DataFrame(d1)

Print(d1)

In [1283]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [1285]:
print(d1.shape)

(5, 2)

Set city = d1['city']

In [1287]:
city=d1['city']

print city <br>
What is the type of city.

In [1289]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [1291]:
d2={
    'city' : ['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
    'Temperature' : [24,35,36,39]
}
d2=pd.DataFrame(d2)
print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [1293]:
print(d2.shape)

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [1295]:
d3=pd.concat([d1,d2],ignore_index=True)
d3=pd.DataFrame(d3)

print(d3)

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
5    Bengalaru           24
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [1297]:
temp_less=d3[d3['Temperature']<=20]
print(temp_less)

print(f'cities with temperature less than or equal to 20:',len(temp_less))

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2
cities with temperature less than or equal to 20: 3

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [1299]:
greater_temp=d3[d3['Temperature'] >=35]
print(greater_temp)

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [1302]:
# write function here

def is_ut(x):
    union=['Chandigarh','Pondicherry','Delhi'] 
    return x in union
d3['is_ut']= d3['city'].apply(is_ut)

In [1303]:
#print d3
print(d3)

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
5    Bengalaru           24  False
6   Coimbatore           35  False
7    Srirangam           36  False
8  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [1306]:
# write function here
def c_to_f(cel):
    fah=(cel * 9/5) + 32
    return fah

check= c_to_f(10)
print(check)

# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['Temp_Fahrenheit']=d3['Temperature'].apply(c_to_f)
print(d3)

50.0
          city  Temperature  is_ut  Temp_Fahrenheit
0   Chandigarh           15   True             59.0
1        Delhi           22   True             71.6
2       Kanpur           20  False             68.0
3      Chennai           26  False             78.8
4       Manali           -2  False             28.4
5    Bengalaru           24  False             75.2
6   Coimbatore           35  False             95.0
7    Srirangam           36  False             96.8
8  Pondicherry           39   True            102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [1309]:
union=['Chandigarh','Pondicherry','Delhi']
d1_ut=d1[d1['city'].isin(union)]
print(d1_ut)

         city  Temperature
0  Chandigarh           15
1       Delhi           22

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [1311]:
d1['Temp_Fahrenheit']=d1['Temperature'].apply(c_to_f)
print(d1)
d1_temp=d1[d1['Temp_Fahrenheit']>=90]
print(d1_temp)

         city  Temperature  Temp_Fahrenheit
0  Chandigarh           15             59.0
1       Delhi           22             71.6
2      Kanpur           20             68.0
3     Chennai           26             78.8
4      Manali           -2             28.4
Empty DataFrame
Columns: [city, Temperature, Temp_Fahrenheit]
Index: []

Select only the first three rows of the dataframe d1.

In [1313]:
d1.head(3)

         city  Temperature  Temp_Fahrenheit
0  Chandigarh           15             59.0
1       Delhi           22             71.6
2      Kanpur           20             68.0

Select all the rows and last two columns in the dataframe.

In [1315]:
d3.iloc[:,-2:]

   is_ut  Temp_Fahrenheit
0   True             59.0
1   True             71.6
2  False             68.0
3  False             78.8
4  False             28.4
5  False             75.2
6  False             95.0
7  False             96.8
8   True            102.2

## Groupby

In [1317]:
# Create a dataframe using dictionary of your choice
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 22, 28, 24],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney'],
    'Salary': [60000, 75000, 55000, 80000, 65000]
}
df=pd.DataFrame(data)

In [1388]:
# Use Groupby of single column with aggregate sum()
grouped=df.groupby('City')['Salary'].sum()
print(grouped)

City
London      75000
New York    60000
Paris       55000
Sydney      65000
Tokyo       80000
Name: Salary, dtype: int64

In [1386]:
# Use Groupby of single column with aggregate count()
grouped=df.groupby('City',as_index=False)['Name'].count()
print(grouped)

       City  Name
0    London     1
1  New York     1
2     Paris     1
3    Sydney     1
4     Tokyo     1

In [1394]:
# Use Groupby of single column with aggregate min() and max()
min_max=df.groupby('City')['Age'].agg(['min','max'])
print(min_max)

          min  max
City
London     30   30
New York   25   25
Paris      22   22
Sydney     24   24
Tokyo      28   28

In [1396]:
# Use Groupby of any 2 columns with aggregate mean()
mean=df.groupby(['City','Age'])['Salary'].mean()
print(mean)

City      Age
London    30     75000.0
New York  25     60000.0
Paris     22     55000.0
Sydney    24     65000.0
Tokyo     28     80000.0
Name: Salary, dtype: float64

In [1400]:
# Use Groupby of any 2 columns with aggregate min() and max()
min_max=df.groupby(['City','Age'])['Salary'].agg(['min','max'])
print(min_max)

                min    max
City     Age
London   30   75000  75000
New York 25   60000  60000
Paris    22   55000  55000
Sydney   24   65000  65000
Tokyo    28   80000  80000

## Date Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [1405]:
a=pd.date_range(start='2020-01-01',end='2021-04-01')
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [1407]:
print(len(a))

457

What is the type of a?

In [1411]:
print(type(a))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>